&НаКлиенте
Процедура Рассчитать(Команда)
    РассчитатьНаСервере();
КонецПроцедуры


&НаСервере
Процедура РассчитатьНаСервере()

    ДокументОбъект = РеквизитФормыВЗначение("Объект");

    Если ДокументОбъект.РассчитатьНачисление() Тогда
        ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
    КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура УслугаПриИзменении(Элемент)
    ЗаполнитьПараметрыУслуги();
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьПараметрыУслуги()

    Если ЗначениеЗаполнено(Объект.Услуга) Тогда
        Объект.Тариф = Объект.Услуга.Тариф;
        Объект.ПоСчетчику = Объект.Услуга.ПоСчетчику;
    Иначе
        Объект.Тариф = 0;
        Объект.ПоСчетчику = Ложь;
    КонецЕсли;

    Объект.ПредыдущееПоказание = 0;
    Объект.ТекущееПоказание = 0;
    Объект.Количество = 0;
    Объект.Сумма = 0;
    Объект.Оплачено = 0;
    Объект.Остаток = 0;

КонецПроцедуры